# **Data Cleaning & Preparation**

### Handling NaN, & Null Value

### **Target Pertemuan**

<hr>

**Tujuan Instruksional Umum:** Peserta mampu mempersiapkan data untuk pembuatan model machine learning.

**Target Pertemuan:** Peserta mampu mendeteksi dan mengelola data kosong (Null & NaN Value)

<hr>

### **Understanding null, undefined and NaN**

#### **1. Null Value**
A null value represents a reference that points, generally intentionally, to a nonexistent or invalid object or address. Even though it points to something non existing, nothing, it’s a global object (and one of JavaScript’s primitive values).

In basic maths operations, null value is converted to 0.

<img src = "i_img.png" style="width:400px;height:300px"/>

#### **2. Undefined**
The global undefined property represents the primitive value undefined. It is one of JavaScript's primitive types. It basically tells us that something isn’t defined. You get this e.g. by displaying a value of variable which don’t have assigned value.

<img src = "j_img.png" style="width:300px;height:250px"/>

**What’s the difference? null vs undefined**

**Similarities**:

   * both when negated are giving true (falsy values), but none of them equals true or false
   * they represent something non existing…

**Differences:**

   * … null represents “nothing”, fully non existing. undefined something which isn’t defined
   * undefined has its own data type (undefined), null is only an object
   * null is treated as 0 in basic arithmetic operations, undefined returns NaN


#### **3. NaN (Not a Number)**

The global NaN property is a value representing Not-A-Number.

I think the definition is clear enough. JavaScript returns this value when number we’re supposed to get isn’t a number. For example, when you’re trying to subtract a “cucumber” from 10 or divide 12 by “R2D2”.

<img src = "k_img.png" style="width:300px;height:250px"/>

<hr>

### **How are NaN value dangerous?**

NaN values are dangerous in two ways:

*    The change of some metrics as mean or median values, therefore giving wrong information to scientists.

*    The sklearn implemented algorithms can’t perform on datasets that have such values (try to implement the TreeDecsisionClassifier on the heart-disease dataset).

<hr>

### **How to Detect Missing Values?**

In Python, we can detect missing values using pandas library. 

``pandas.isnull()``

``pandas.isna()``

``pandas.isnull().sum()``

``pandas.isna().sum()``

In [5]:
# ambil dataset harga rumah 
from sklearn.datasets import load_boston
#import library
import pandas as pd
import numpy as np

In [10]:
X, y = load_boston(return_X_y=True)
df_boston = pd.DataFrame(X, y)
df_boston.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12
24.0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98
21.6,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14
34.7,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03
33.4,0.03237,0.0,2.18,0.0,0.458,6.998,45.8,6.0622,3.0,222.0,18.7,394.63,2.94
36.2,0.06905,0.0,2.18,0.0,0.458,7.147,54.2,6.0622,3.0,222.0,18.7,396.90,5.33

In [12]:
# mengecek adanya data kosong di setiap kolom
df_boston.isnull().sum()

0     0
1     0
2     0
3     0
4     0
5     0
6     0
7     0
8     0
9     0
10    0
11    0
12    0
dtype: int64

In [13]:
df_boston.isna().sum()

0     0
1     0
2     0
3     0
4     0
5     0
6     0
7     0
8     0
9     0
10    0
11    0
12    0
dtype: int64

<hr>

### **How to handle missing values?**

In Python, we can detect missing values using pandas library. 

*     To erase the rows that have NaN values. But this is not a good choice because in such a way we lose the information, especially when we work with small datasets.
*    To impute NaN values with specific methods or values. This article refers to these methods.

There are a lot of ways to impute these gaps and in most cases, Data Scientists, especially newbies, don’t know them. Here are the ways to do that:

    Inpute them with specific values.
    Impute with special metrics, for example, mean or median.
    Impute using a method: MICE or KNN.

### **1) Drop Missing Values**

In [37]:
df = pd.read_csv('melb_data.csv')
df.head()

,Suburb,Address,Rooms,Type,Price,Method,SellerG,Date,Distance,Postcode,...,Bathroom,Car,Landsize,BuildingArea,YearBuilt,CouncilArea,Lattitude,Longtitude,Regionname,Propertycount
0,Abbotsford,85 Turner St,2,h,1480000.0,S,Biggin,3/12/2016,2.5,3067.0,...,1.0,1.0,202.0,NaN,NaN,Yarra,-37.7996,144.9984,Northern Metropolitan,4019.0
1,Abbotsford,25 Bloomburg St,2,h,1035000.0,S,Biggin,4/02/2016,2.5,3067.0,...,1.0,0.0,156.0,79.0,1900.0,Yarra,-37.8079,144.9934,Northern Metropolitan,4019.0
2,Abbotsford,5 Charles St,3,h,1465000.0,SP,Biggin,4/03/2017,2.5,3067.0,...,2.0,0.0,134.0,150.0,1900.0,Yarra,-37.8093,144.9944,Northern Metropolitan,4019.0
3,Abbotsford,40 Federation La,3,h,850000.0,PI,Biggin,4/03/2017,2.5,3067.0,...,2.0,1.0,94.0,NaN,NaN,Yarra,-37.7969,144.9969,Northern Metropolitan,4019.0
4,Abbotsford,55a Park St,4,h,1600000.0,VB,Nelson,4/06/2016,2.5,3067.0,...,1.0,2.0,120.0,142.0,2014.0,Yarra,-37.8072,144.9941,Northern Metropolitan,4019.0

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13580 entries, 0 to 13579
Data columns (total 21 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Suburb         13580 non-null  object
 1   Address        13580 non-null  object
 2   Rooms          13580 non-null  int64
 3   Type           13580 non-null  object
 4   Price          13580 non-null  float64
 5   Method         13580 non-null  object
 6   SellerG        13580 non-null  object
 7   Date           13580 non-null  object
 8   Distance       13580 non-null  float64
 9   Postcode       13580 non-null  float64
 10  Bedroom2       13580 non-null  float64
 11  Bathroom       13580 non-null  float64
 12  Car            13518 non-null  float64
 13  Landsize       13580 non-null  float64
 14  BuildingArea   7130 non-null   float64
 15  YearBuilt      8205 non-null   float64
 16  CouncilArea    12211 non-null  object
 17  Lattitude      13580 non-null  float64
 18  Longtitude     13580 non-null  float64
 19  Regionname     13580 non-null  object
 20  Propertycount  13580 non-null  float64
dtypes: float64(12), int64(1), object(8)
memory usage: 1.8+ MB

In [ ]:
TABEL
PRICE         CAR
1-5           100
6-10          200
10-15         300

LANDSIZE



MENGISI DATA KOSONG DI CAR

In [16]:
df.isna().sum()

Suburb              0
Address             0
Rooms               0
Type                0
Price               0
Method              0
SellerG             0
Date                0
Distance            0
Postcode            0
Bedroom2            0
Bathroom            0
Car                62
Landsize            0
BuildingArea     6450
YearBuilt        5375
CouncilArea      1369
Lattitude           0
Longtitude          0
Regionname          0
Propertycount       0
dtype: int64

In [17]:
kolom_kosong = (df.isnull().sum())
print(kolom_kosong[kolom_kosong > 0])

Car               62
BuildingArea    6450
YearBuilt       5375
CouncilArea     1369
dtype: int64

In [19]:
# copy dataset
df1 = df.copy()

In [22]:
# DROP MISSING VALUES
df1_dropped1 = df1.dropna()

In [21]:
df1_dropped1.isna().sum()

Suburb           0
Address          0
Rooms            0
Type             0
Price            0
Method           0
SellerG          0
Date             0
Distance         0
Postcode         0
Bedroom2         0
Bathroom         0
Car              0
Landsize         0
BuildingArea     0
YearBuilt        0
CouncilArea      0
Lattitude        0
Longtitude       0
Regionname       0
Propertycount    0
dtype: int64

In [23]:
df1_dropped1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6196 entries, 1 to 12212
Data columns (total 21 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Suburb         6196 non-null   object
 1   Address        6196 non-null   object
 2   Rooms          6196 non-null   int64
 3   Type           6196 non-null   object
 4   Price          6196 non-null   float64
 5   Method         6196 non-null   object
 6   SellerG        6196 non-null   object
 7   Date           6196 non-null   object
 8   Distance       6196 non-null   float64
 9   Postcode       6196 non-null   float64
 10  Bedroom2       6196 non-null   float64
 11  Bathroom       6196 non-null   float64
 12  Car            6196 non-null   float64
 13  Landsize       6196 non-null   float64
 14  BuildingArea   6196 non-null   float64
 15  YearBuilt      6196 non-null   float64
 16  CouncilArea    6196 non-null   object
 17  Lattitude      6196 non-null   float64
 18  Longtitude     6196 non-null   float64
 19  Regionname     6196 non-null   object
 20  Propertycount  6196 non-null   float64
dtypes: float64(12), int64(1), object(8)
memory usage: 871.3+ KB

__Menghapus kolom yang memiliki data kosong__

In [24]:
df2 = df.copy()

In [27]:
df2_dropped = df.dropna(axis = 'columns')

In [28]:
df2_dropped.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13580 entries, 0 to 13579
Data columns (total 17 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Suburb         13580 non-null  object
 1   Address        13580 non-null  object
 2   Rooms          13580 non-null  int64
 3   Type           13580 non-null  object
 4   Price          13580 non-null  float64
 5   Method         13580 non-null  object
 6   SellerG        13580 non-null  object
 7   Date           13580 non-null  object
 8   Distance       13580 non-null  float64
 9   Postcode       13580 non-null  float64
 10  Bedroom2       13580 non-null  float64
 11  Bathroom       13580 non-null  float64
 12  Landsize       13580 non-null  float64
 13  Lattitude      13580 non-null  float64
 14  Longtitude     13580 non-null  float64
 15  Regionname     13580 non-null  object
 16  Propertycount  13580 non-null  float64
dtypes: float64(9), int64(1), object(7)
memory usage: 1.4+ MB

### **2) Impute Missing Values**

There are many options we could consider when replacing a missing value, for example:

*    A constant value that has meaning within the domain, such as 0, distinct from all other values.
*    A value from another randomly selected record.
*    A mean, median or mode value for the column.
*    A value estimated by another predictive model.

In [41]:
df3 = df.copy()
df3['BuildingArea'].describe()

count     7130.000000
mean       151.967650
std        541.014538
min          0.000000
25%         93.000000
50%        126.000000
75%        174.000000
max      44515.000000
Name: BuildingArea, dtype: float64

In [42]:
df3[df3['BuildingArea'].isna() == True].head()

,Suburb,Address,Rooms,Type,Price,Method,SellerG,Date,Distance,Postcode,...,Bathroom,Car,Landsize,BuildingArea,YearBuilt,CouncilArea,Lattitude,Longtitude,Regionname,Propertycount
0,Abbotsford,85 Turner St,2,h,1480000.0,S,Biggin,3/12/2016,2.5,3067.0,...,1.0,1.0,202.0,NaN,NaN,Yarra,-37.7996,144.9984,Northern Metropolitan,4019.0
3,Abbotsford,40 Federation La,3,h,850000.0,PI,Biggin,4/03/2017,2.5,3067.0,...,2.0,1.0,94.0,NaN,NaN,Yarra,-37.7969,144.9969,Northern Metropolitan,4019.0
5,Abbotsford,129 Charles St,2,h,941000.0,S,Jellis,7/05/2016,2.5,3067.0,...,1.0,0.0,181.0,NaN,NaN,Yarra,-37.8041,144.9953,Northern Metropolitan,4019.0
8,Abbotsford,6/241 Nicholson St,1,u,300000.0,S,Biggin,8/10/2016,2.5,3067.0,...,1.0,1.0,0.0,NaN,NaN,Yarra,-37.8008,144.9973,Northern Metropolitan,4019.0
10,Abbotsford,411/8 Grosvenor St,2,u,700000.0,VB,Jellis,12/11/2016,2.5,3067.0,...,2.0,1.0,0.0,NaN,NaN,Yarra,-37.8110,145.0067,Northern Metropolitan,4019.0

In [43]:
# mengisi data continous dengan nilai median/nilai tengah
df3_filled_buildingArea = df3['BuildingArea'].fillna(df['BuildingArea'].mean())
df3_filled_buildingArea

0        151.96765
1         79.00000
2        150.00000
3        151.96765
4        142.00000
           ...
13575    151.96765
13576    133.00000
13577    151.96765
13578    157.00000
13579    112.00000
Name: BuildingArea, Length: 13580, dtype: float64

In [36]:
# mengisi semua data kosong di df3 dengan nilai rata-rata
df3_filled = df3.fillna(df3.mean())
df3_filled.isna().sum()

Suburb              0
Address             0
Rooms               0
Type                0
Price               0
Method              0
SellerG             0
Date                0
Distance            0
Postcode            0
Bedroom2            0
Bathroom            0
Car                 0
Landsize            0
BuildingArea        0
YearBuilt           0
CouncilArea      1369
Lattitude           0
Longtitude          0
Regionname          0
Propertycount       0
dtype: int64

In [39]:
# feature 'CouncilArea' masih ada data kosong, karena berupa categorical-> string
# cara instannya, feature ini bisa diisi dengan modus
df3['CouncilArea'].describe()

count        12211
unique          33
top       Moreland
freq          1163
Name: CouncilArea, dtype: object

In [40]:
df3_filled['CouncilArea'] = df3_filled['CouncilArea'].fillna('Moreland')
df3_filled.isna().sum()

Suburb           0
Address          0
Rooms            0
Type             0
Price            0
Method           0
SellerG          0
Date             0
Distance         0
Postcode         0
Bedroom2         0
Bathroom         0
Car              0
Landsize         0
BuildingArea     0
YearBuilt        0
CouncilArea      0
Lattitude        0
Longtitude       0
Regionname       0
Propertycount    0
dtype: int64

<hr>

# __Best Practice to Fill Missing Values__

### 1. Lihat __feature/kolom lain__ yang bisa dijadikan acuan/pertimbangan mengisi data kosong.
Contoh: mengisi data kosong di kolom usia dapat mempertimbangkan status pendidikan atau status pernikahan. Mengisi data kosong di kolom gaji/pendapatan, kita bisa mempertimbangkan profesi dan pengalaman kerja. 

### 2. __Isi data kosong__ menggunakan hasil pengolahan/pertimbangan feature lainnya
Isi data kosong dengan menggunakan data rata-rata/median berdasarkan kolom/feature lainnya. Misalnya, data usia kosong. Tapi ada informasi dia berpendidikan S1 dan sudah menikah. Kita pakai __domain knowledge di Indonesia__. Umumnya lulus sarjana usia di atas 20 tahun. Usia menikah rata-rata sekitar 20 - 30 tahun. Kita bisa ambil nilai tengahnya, yaitu 25 tahun. Hal ini relatif lebih logis dan bisa dipertangung jawabkan, dibandingkan langsung mencari rata-rata usia dari seluruh karyawan di suatu perusahaan.

___

#### **Reference**:

* Kuba Michalski, "Understanding null, undefined and NaN", https://codeburst.io/understanding-null-undefined-and-nan-b603cb74b44c
* Vasile Păpăluță, "What’s the best way to handle NaN values?", https://towardsdatascience.com/whats-the-best-way-to-handle-nan-values-62d50f738fc
* Jiahui Wang, "Dealing with Missing Values NaN and None in Python", https://medium.com/analytics-vidhya/dealing-with-missing-values-nan-and-none-in-python-6fc9b8fb4f31